app/views/users/nombre_de_sms_par_utilisateur.csv.erb

	<% @users.each do |user| %>
		<% if User.find_by_phone_number(user.phone_number).eql?(nil) %>
---
SELECT "users".* FROM "users" WHERE "users"."phone_number" = '60086286' ORDER BY created_at ASC LIMIT 1