app/views/users/nombre_de_sms_par_utilisateur.html.erb

SELECT "users".* FROM "users" WHERE "users"."phone_number" = '62086286' ORDER BY created_at ASC LIMIT 1
---
			<td>
				<% if User.find_by_phone_number(user.phone_number).eql?(nil) %>