app/views/users/nombre_de_sms_par_couple.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY created_at ASC LIMIT 1
---
			<td>
				<%= "#{User.find_by_id(user.user_id).phone_number} | #{user.receiver}" %>