app/views/users/stats.html.erb


<%= link_to "parametres", edit_parameter_path(Parameter.first.id) %>
---
SELECT "parameters".* FROM "parameters" LIMIT 1