app/controllers/administrators_controller.rb

SELECT "users".* FROM "users" ORDER BY created_at ASC LIMIT 4 OFFSET 4
SELECT COUNT(*) FROM "users"
---
	def new
		@administrator = Administrator.new
		@posts = User.paginate(:page => params[:page], :per_page => 4)

SELECT "administrators".* FROM "administrators" WHERE "administrators"."id" = 3 LIMIT 1
---
	def edit
		@administrator = Administrator.find(params[:id])

SELECT "administrators".* FROM "administrators" WHERE "administrators"."id" = 3 LIMIT 1
UPDATE "administrators" SET "hashed_password" = 'e04d5c4d727af60d2b9dcb6a3bcfee6f5c26d963', "updated_at" = '2012-01-01 18:50:08.625573' WHERE "administrators"."id" = 3
---
	def update
		@administrator = Administrator.find(params[:id])
		if @administrator.update_attributes(params[:administrator])