app/controllers/parameters_controller.rb

	def edit
		@parameters = Parameter.first
---
SELECT "parameters".* FROM "parameters" LIMIT 1

	def update
		Parameter.first.update_attributes(params[:parameter])
---
SELECT "parameters".* FROM "parameters" LIMIT 1
UPDATE "parameters" SET "break_relationship" = 'brise', "updated_at" = '2011-12-29 16:34:37.755250' WHERE "parameters"."id" = 1