app/controllers/users_controller.rb

  def stats
  	@parameters = Parameter.first
---
SELECT "parameters".* FROM "parameters" LIMIT 1

  def nombre_de_sms_par_utilisateur
  	@users_pagination = Counter.all.paginate(:page => params[:page], :per_page => 10)
---
SELECT "counters".* FROM "counters" ORDER BY sms_number DESC

  def nombre_de_sms_par_utilisateur_mail
  	@users = Counter.all
  	@pseudo = ''
  	CSV.open("#{RAILS_ROOT}/public/attachments/nombre_de_sms_par_utilisateur.csv", "wb", :col_sep => ";") do |csv|
  		csv << ["NUMERO DE TELEPHONE", "PSEUDONYME", "NOMBRE DE SMS ENVOYES"]
  		csv << ["", "", ""]
  		unless @users.eql?(nil)
				@users.each do |user|
					if User.find_by_phone_number(user.phone_number).eql?(nil)
---
SELECT "counters".* FROM "counters" ORDER BY sms_number DESC
SELECT "users".* FROM "users" WHERE "users"."phone_number" = '60086286' ORDER BY created_at ASC LIMIT 1

  def reports
  	@users = User.all
---
SELECT "users".* FROM "users" ORDER BY created_at DESC

  def write_to_disk
  	@users = User.all
---
SELECT "users".* FROM "users" ORDER BY created_at ASC